<abi-corpus-group version='2.1' architecture='elf-amd-x86_64'>
  <abi-corpus version='2.1' path='vmlinux' architecture='elf-amd-x86_64'>
    <elf-function-symbols>
      <elf-symbol name='__SCT__cond_resched' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc07351b3'/>
      <elf-symbol name='__SCT__kvm_x86_cache_reg' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x59387ba3'/>
      <elf-symbol name='__SCT__kvm_x86_get_cs_db_l_bits' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x53d9f927'/>
      <elf-symbol name='__SCT__kvm_x86_tlb_flush_current' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x814dd11'/>
      <elf-symbol name='__SCT__might_resched' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xe2c17b5d'/>
      <elf-symbol name='__SCT__preempt_schedule' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x48d88a2c'/>
      <elf-symbol name='__SCT__preempt_schedule_notrace' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x688e72e1'/>
      <elf-symbol name='__SCT__tp_func_android_rvh_account_irq' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x405c6fae'/>

      <elf-symbol name='__get_user_8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x6d334118'/>
      <elf-symbol name='__get_user_nocheck_1' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4b5e3a47'/>
      <elf-symbol name='__get_user_nocheck_2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd2bc5c46'/>
      <elf-symbol name='__get_user_nocheck_4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x3a099605'/>
      <elf-symbol name='__get_user_nocheck_8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x301304c2'/>
      <elf-symbol name='__memcpy' type='func-type' binding='global-binding' visibility='default-visibility' alias='memcpy' is-defined='yes' crc='0xecac8407'/>
      <elf-symbol name='__memmove' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x6052f8d'/>
      <elf-symbol name='__memset' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4c62fd7'/>
      <elf-symbol name='__put_user_1' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xc3aaf0a9'/>
      <elf-symbol name='__put_user_2' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x5a4896a8'/>
      <elf-symbol name='__put_user_4' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xb2fd5ceb'/>
      <elf-symbol name='__put_user_8' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xb8e7ce2c'/>
      <elf-symbol name='__sw_hweight32' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x74c134b9'/>
      <elf-symbol name='__sw_hweight64' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x9f46ced8'/>
      <elf-symbol name='asm_load_gs_index' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa931af8a'/>
      <elf-symbol name='clear_page_erms' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x9084b044'/>
      <elf-symbol name='clear_page_orig' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x925493f'/>
      <elf-symbol name='clear_page_rep' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x23b4e0d7'/>
      <elf-symbol name='copy_page' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x33b84f74'/>
      <elf-symbol name='copy_user_enhanced_fast_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x21271fd0'/>
      <elf-symbol name='copy_user_generic_string' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x1f199d24'/>
      <elf-symbol name='copy_user_generic_unrolled' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xecdcabd2'/>
      <elf-symbol name='entry_ibpb' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x50b42ba1'/>
      <elf-symbol name='memcpy' type='func-type' binding='weak-binding' visibility='default-visibility' is-defined='yes' crc='0x69acdf38'/>
      <elf-symbol name='memmove' type='func-type' binding='weak-binding' visibility='default-visibility' alias='__memmove' is-defined='yes' crc='0xb0e602eb'/>
      <elf-symbol name='memset' type='func-type' binding='weak-binding' visibility='default-visibility' alias='__memset' is-defined='yes' crc='0xfb578fc5'/>
      <elf-symbol name='native_save_fl' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x9d70541a'/>
      <elf-symbol name='preempt_schedule_notrace_thunk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x3b72f08d'/>
      <elf-symbol name='preempt_schedule_thunk' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xd6742002'/>
      <elf-symbol name='rdmsr_safe_regs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4cd5bc5e'/>
      <elf-symbol name='wrmsr_safe_regs' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0xa836ba02'/>
      <elf-symbol name='zen_untrain_ret' type='func-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x6b695cf1'/>
    </elf-function-symbols>
    <elf-variable-symbols>
      <elf-symbol name='empty_zero_page' size='4096' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x815f2897'/>
      <elf-symbol name='jiffies' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x15ba50a6'/>
      <elf-symbol name='phys_base' size='8' type='object-type' binding='global-binding' visibility='default-visibility' is-defined='yes' crc='0x4c9d28b0'/>
    </elf-variable-symbols>
    <abi-instr address-size='64' path='arch/x86/crypto/aesni-intel_glue.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='1920' id='08b4ad9f'>
        <subrange length='60' type-id='7ff19f0f' id='b114e3c3'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='2048' id='dbaf9da9'>
        <subrange length='256' type-id='7ff19f0f' id='36e5b9fa'/>
      </array-type-def>
      <class-decl name='gcm_context_data' size-in-bits='2816' is-struct='yes' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='70' column='1' id='bce0a6e7'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='aad_hash' type-id='0d8415b5' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='72' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='aad_length' type-id='91ce1af9' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='73' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='in_length' type-id='91ce1af9' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='74' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='partial_block_enc_key' type-id='0d8415b5' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='75' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='orig_IV' type-id='0d8415b5' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='76' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='current_counter' type-id='0d8415b5' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='77' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='partial_block_len' type-id='91ce1af9' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='78' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='unused' type-id='91ce1af9' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='79' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='hash_keys' type-id='dbaf9da9' visibility='default' filepath='arch/x86/crypto/aesni-intel_glue.c' line='80' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='crypto_aes_ctx' size-in-bits='3872' is-struct='yes' visibility='default' filepath='include/crypto/aes.h' line='25' column='1' id='b5b9216e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='key_enc' type-id='08b4ad9f' visibility='default' filepath='include/crypto/aes.h' line='26' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='key_dec' type-id='08b4ad9f' visibility='default' filepath='include/crypto/aes.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3840'>
          <var-decl name='key_length' type-id='19c2251e' visibility='default' filepath='include/crypto/aes.h' line='28' column='1'/>
        </data-member>
      </class-decl>
      <qualified-type-def type-id='b5b9216e' const='yes' id='09f052f7'/>
      <pointer-type-def type-id='09f052f7' size-in-bits='64' id='825271e7'/>
      <pointer-type-def type-id='b5b9216e' size-in-bits='64' id='21370cb4'/>
      <pointer-type-def type-id='bce0a6e7' size-in-bits='64' id='c094fa8f'/>
      <function-decl name='aesni_set_key' filepath='arch/x86/crypto/aesni-intel_glue.c' line='83' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='aesni_enc' filepath='arch/x86/crypto/aesni-intel_glue.c' line='85' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_dec' filepath='arch/x86/crypto/aesni-intel_glue.c' line='86' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_ecb_enc' filepath='arch/x86/crypto/aesni-intel_glue.c' line='87' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_ecb_dec' filepath='arch/x86/crypto/aesni-intel_glue.c' line='89' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_cbc_enc' filepath='arch/x86/crypto/aesni-intel_glue.c' line='91' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='8bff8096'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_cbc_dec' filepath='arch/x86/crypto/aesni-intel_glue.c' line='93' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='8bff8096'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_cts_cbc_enc' filepath='arch/x86/crypto/aesni-intel_glue.c' line='95' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='8bff8096'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_cts_cbc_dec' filepath='arch/x86/crypto/aesni-intel_glue.c' line='97' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='21370cb4'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='8bff8096'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_xts_encrypt' filepath='arch/x86/crypto/aesni-intel_glue.c' line='103' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='825271e7'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='8bff8096'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_xts_decrypt' filepath='arch/x86/crypto/aesni-intel_glue.c' line='106' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='825271e7'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='8bff8096'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_init' filepath='arch/x86/crypto/aesni-intel_glue.c' line='116' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_enc_update' filepath='arch/x86/crypto/aesni-intel_glue.c' line='121' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_dec_update' filepath='arch/x86/crypto/aesni-intel_glue.c' line='124' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_finalize' filepath='arch/x86/crypto/aesni-intel_glue.c' line='128' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aes_ctr_enc_128_avx_by8' filepath='arch/x86/crypto/aesni-intel_glue.c' line='132' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aes_ctr_enc_192_avx_by8' filepath='arch/x86/crypto/aesni-intel_glue.c' line='134' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aes_ctr_enc_256_avx_by8' filepath='arch/x86/crypto/aesni-intel_glue.c' line='136' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aes_xctr_enc_128_avx_by8' filepath='arch/x86/crypto/aesni-intel_glue.c' line='140' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aes_xctr_enc_192_avx_by8' filepath='arch/x86/crypto/aesni-intel_glue.c' line='144' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aes_xctr_enc_256_avx_by8' filepath='arch/x86/crypto/aesni-intel_glue.c' line='148' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='f0981eeb'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_init_avx_gen2' filepath='arch/x86/crypto/aesni-intel_glue.c' line='157' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_enc_update_avx_gen2' filepath='arch/x86/crypto/aesni-intel_glue.c' line='164' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_dec_update_avx_gen2' filepath='arch/x86/crypto/aesni-intel_glue.c' line='167' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_finalize_avx_gen2' filepath='arch/x86/crypto/aesni-intel_glue.c' line='171' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_init_avx_gen4' filepath='arch/x86/crypto/aesni-intel_glue.c' line='180' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_enc_update_avx_gen4' filepath='arch/x86/crypto/aesni-intel_glue.c' line='187' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_dec_update_avx_gen4' filepath='arch/x86/crypto/aesni-intel_glue.c' line='190' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='aesni_gcm_finalize_avx_gen4' filepath='arch/x86/crypto/aesni-intel_glue.c' line='194' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='c094fa8f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='3aa0f67c'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/crypto/blake2s-glue.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='64' id='1872161b'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <class-decl name='blake2s_state' size-in-bits='960' is-struct='yes' visibility='default' filepath='include/crypto/blake2s.h' line='25' column='1' id='d93b0d0b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='h' type-id='1c6311dd' visibility='default' filepath='include/crypto/blake2s.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='t' type-id='1872161b' visibility='default' filepath='include/crypto/blake2s.h' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='f' type-id='1872161b' visibility='default' filepath='include/crypto/blake2s.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='buf' type-id='47ba3182' visibility='default' filepath='include/crypto/blake2s.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='buflen' type-id='f0981eeb' visibility='default' filepath='include/crypto/blake2s.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='928'>
          <var-decl name='outlen' type-id='f0981eeb' visibility='default' filepath='include/crypto/blake2s.h' line='32' column='1'/>
        </data-member>
      </class-decl>
      <pointer-type-def type-id='d93b0d0b' size-in-bits='64' id='2c07f8cb'/>
      <qualified-type-def type-id='b59d7dce' const='yes' id='d0fa5dde'/>
      <function-decl name='blake2s_compress_ssse3' filepath='arch/x86/crypto/blake2s-glue.c' line='19' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='2c07f8cb'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='d0fa5dde'/>
        <parameter type-id='51bb592e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='blake2s_compress_avx512' filepath='arch/x86/crypto/blake2s-glue.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='2c07f8cb'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='d0fa5dde'/>
        <parameter type-id='51bb592e'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/crypto/chacha_glue.c' language='LANG_C89'>
      <function-decl name='chacha_block_xor_ssse3' filepath='arch/x86/crypto/chacha_glue.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_4block_xor_ssse3' filepath='arch/x86/crypto/chacha_glue.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='hchacha_block_ssse3' filepath='arch/x86/crypto/chacha_glue.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='aded214c'/>
        <parameter type-id='f9409001'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_2block_xor_avx2' filepath='arch/x86/crypto/chacha_glue.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_4block_xor_avx2' filepath='arch/x86/crypto/chacha_glue.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_8block_xor_avx2' filepath='arch/x86/crypto/chacha_glue.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_2block_xor_avx512vl' filepath='arch/x86/crypto/chacha_glue.c' line='31' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_4block_xor_avx512vl' filepath='arch/x86/crypto/chacha_glue.c' line='33' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='chacha_8block_xor_avx512vl' filepath='arch/x86/crypto/chacha_glue.c' line='35' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='f0981eeb'/>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/crypto/poly1305_glue.c' language='LANG_C89'>
      <function-decl name='poly1305_init_x86_64' filepath='arch/x86/crypto/poly1305_glue.c' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='bbaf3419'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_blocks_x86_64' filepath='arch/x86/crypto/poly1305_glue.c' line='20' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='d0fa5dde'/>
        <parameter type-id='51bb592e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_emit_x86_64' filepath='arch/x86/crypto/poly1305_glue.c' line='22' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='aded214c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_emit_avx' filepath='arch/x86/crypto/poly1305_glue.c' line='24' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='8bff8096'/>
        <parameter type-id='aded214c'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_blocks_avx' filepath='arch/x86/crypto/poly1305_glue.c' line='26' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='d0fa5dde'/>
        <parameter type-id='51bb592e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_blocks_avx2' filepath='arch/x86/crypto/poly1305_glue.c' line='28' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='d0fa5dde'/>
        <parameter type-id='51bb592e'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='poly1305_blocks_avx512' filepath='arch/x86/crypto/poly1305_glue.c' line='30' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='d0fa5dde'/>
        <parameter type-id='51bb592e'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/crypto/polyval-clmulni_glue.c' language='LANG_C89'>
      <array-type-def dimensions='2' type-id='f9b06939' size-in-bits='1024' id='183d89c7'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <class-decl name='polyval_tfm_ctx' size-in-bits='1024' is-struct='yes' visibility='default' filepath='arch/x86/crypto/polyval-clmulni_glue.c' line='36' column='1' id='afd205da'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='key_powers' type-id='183d89c7' visibility='default' filepath='arch/x86/crypto/polyval-clmulni_glue.c' line='40' column='1'/>
        </data-member>
      </class-decl>
      <qualified-type-def type-id='afd205da' const='yes' id='2db22461'/>
      <pointer-type-def type-id='2db22461' size-in-bits='64' id='3a6f2211'/>
      <function-decl name='clmul_polyval_update' filepath='arch/x86/crypto/polyval-clmulni_glue.c' line='48' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='3a6f2211'/>
        <parameter type-id='bbaf3419'/>
        <parameter type-id='b59d7dce'/>
        <parameter type-id='8bff8096'/>
        <return type-id='48b5725f'/>
      </function-decl>
      <function-decl name='clmul_polyval_mul' filepath='arch/x86/crypto/polyval-clmulni_glue.c' line='50' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='8bff8096'/>
        <parameter type-id='bbaf3419'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kernel/acpi/sleep.c' language='LANG_C89'>
      <function-decl name='do_suspend_lowlevel' filepath='arch/x86/kernel/acpi/sleep.h' line='18' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kernel/cpu/amd.c' language='LANG_C89'>
      <function-decl name='rdmsr_safe_regs' filepath='arch/x86/include/asm/msr.h' line='177' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <return type-id='95e97e5e'/>
      </function-decl>
      <function-decl name='wrmsr_safe_regs' filepath='arch/x86/include/asm/msr.h' line='178' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='f9409001'/>
        <return type-id='95e97e5e'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kernel/dumpstack.c' language='LANG_C89'>
      <function-decl name='rewind_stack_and_make_dead' filepath='arch/x86/kernel/dumpstack.c' line='354' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='95e97e5e'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kernel/smpboot.c' language='LANG_C89'>
      <function-decl name='start_cpu0' filepath='arch/x86/include/asm/cpu.h' line='32' column='1' visibility='default' binding='global' size-in-bits='64'>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kernel/traps.c' language='LANG_C89'>
      <function-decl name='__memcpy' filepath='arch/x86/include/asm/string_64.h' line='15' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='eaa32e2f'/>
        <parameter type-id='b59d7dce'/>
        <return type-id='eaa32e2f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kvm/svm/svm.c' language='LANG_C89'>
      <function-decl name='__svm_vcpu_run' filepath='arch/x86/kvm/svm/svm.h' line='578' column='1' visibility='default' binding='global' size-in-bits='64'>
        <parameter type-id='3aa0f67c'/>
        <parameter type-id='a163c962'/>
        <return type-id='48b5725f'/>
      </function-decl>
    </abi-instr>
    <abi-instr address-size='64' path='arch/x86/kvm/vmx/vmx.c' language='LANG_C89'>
      <array-type-def dimensions='1' type-id='d315442e' size-in-bits='48' id='450d2a3a'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='3f1a6b60' size-in-bits='128' id='3fa29bab'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='1024' id='364a15d5'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='128' id='8a7b7524'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='1920' id='cf693a35'>
        <subrange length='30' type-id='7ff19f0f' id='6a6183a4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='2048' id='0b651b7b'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='256' id='ce805d5e'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='384' id='8a846f80'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d3130597' size-in-bits='576' id='8a5f9ea7'>
        <subrange length='9' type-id='7ff19f0f' id='12e4273c'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='120' id='539eb4c0'>
        <subrange length='15' type-id='7ff19f0f' id='8484ba73'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='216' id='26e9ba97'>
        <subrange length='27' type-id='7ff19f0f' id='fddb82f0'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='16' id='0618bc0e'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='240' id='ba63b9e3'>
        <subrange length='30' type-id='7ff19f0f' id='6a6183a4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='48' id='c60dc9f2'>
        <subrange length='6' type-id='7ff19f0f' id='52fa524b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='56' id='c20b850f'>
        <subrange length='7' type-id='7ff19f0f' id='16fc326e'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='8f048e17' size-in-bits='64' id='0209ab38'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='28ee064c' size-in-bits='1024' id='89ad18bc'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='28ee064c' size-in-bits='192' id='fdeae366'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='49178f86' size-in-bits='512' id='e8e9f1f6'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='2048' id='d1617432'>
        <subrange length='256' type-id='7ff19f0f' id='36e5b9fa'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='a84c031d' size-in-bits='384' id='36d7f119'>
        <subrange length='48' type-id='7ff19f0f' id='8f6d2a81'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='b05bb00a' size-in-bits='4096' id='a66924eb'>
        <subrange length='64' type-id='7ff19f0f' id='b10be967'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e151255a' size-in-bits='262144' id='45381fab'>
        <subrange length='4096' type-id='7ff19f0f' id='bc1b5ddc'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e151255a' size-in-bits='infinite' id='579ff952'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='95e97e5e' size-in-bits='2304' id='02bcc761'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
        <subrange length='24' type-id='7ff19f0f' id='fdd3342b'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e53d7a90' size-in-bits='infinite' id='a5527824'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='62778ae5' size-in-bits='infinite' id='7290550d'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='1c475548' size-in-bits='infinite' id='def29f5c'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='6849d994' size-in-bits='infinite' id='dc4db8d8'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='23b57391' size-in-bits='256' id='3619bd99'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f68ded82' size-in-bits='infinite' id='c9ac839a'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='c8a1e3d1' size-in-bits='512' id='2dc8a603'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='fd4429f9' size-in-bits='4096' id='9cb3420a'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='fd4429f9' size-in-bits='512' id='fd2b8645'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='fd4429f9' size-in-bits='infinite' id='1110cd41'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='3689e4be' size-in-bits='128' id='47b495de'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e413f614' size-in-bits='infinite' id='675a1728'>
        <subrange length='infinite' type-id='7ff19f0f' id='031f2035'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='745b542c' size-in-bits='128' id='a6e811e8'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='797d798f' size-in-bits='384' id='16a8c50d'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='157e158b' size-in-bits='384' id='96a42304'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='21d52cc3' size-in-bits='2048' id='ec36648f'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='39825120' size-in-bits='14336' id='60972f2b'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='39825120' size-in-bits='1792' id='204d098e'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f828203f' size-in-bits='192' id='691f9b70'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='276204bb' size-in-bits='1536' id='826ee6a7'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='272aff5d' size-in-bits='1536' id='2744d0d1'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='d95adfa2' size-in-bits='11776' id='50df0408'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='e50f5e97' size-in-bits='3072' id='1e971f6a'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='4d29a16e' size-in-bits='704' id='e09e99f5'>
        <subrange length='88' type-id='7ff19f0f' id='7425c2b5'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='59d77292' size-in-bits='256' id='df5b6e8d'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='59d77292' size-in-bits='512' id='df6468e9'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='ba226bd5' size-in-bits='524272' id='6f1a39da'>
        <subrange length='32767' type-id='7ff19f0f' id='4ae4961a'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='1dc6a898' size-in-bits='48' id='02695550'>
        <subrange length='3' type-id='7ff19f0f' id='56f209d2'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='512' id='02fdec64'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='128' id='1c6c0c39'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='19c2251e' size-in-bits='256' id='1c6311dd'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='64' id='64a61909'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='2' type-id='91ce1af9' size-in-bits='640' id='a4295685'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
        <subrange length='5' type-id='7ff19f0f' id='53010e10'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='2048' id='ef7c8fe9'>
        <subrange length='32' type-id='7ff19f0f' id='ae5bde82'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='91ce1af9' size-in-bits='256' id='20b279f0'>
        <subrange length='4' type-id='7ff19f0f' id='16fe7105'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='8192' id='07312fb9'>
        <subrange length='1024' type-id='7ff19f0f' id='c60446f8'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='120' id='4d823bde'>
        <subrange length='15' type-id='7ff19f0f' id='8484ba73'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='128' id='0d8415b5'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='f9b06939' size-in-bits='16' id='cf114704'>
        <subrange length='2' type-id='7ff19f0f' id='52efc4ef'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='3aa0f67c' size-in-bits='65536' id='5ddeb3ad'>
        <subrange length='1024' type-id='7ff19f0f' id='c60446f8'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='3aa0f67c' size-in-bits='1024' id='8b2a5b59'>
        <subrange length='16' type-id='7ff19f0f' id='848d0938'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='3aa0f67c' size-in-bits='1088' id='472c2ee4'>
        <subrange length='17' type-id='7ff19f0f' id='888ad0ed'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='0ea7275a' size-in-bits='64' id='0349d241'>
        <subrange length='1' type-id='7ff19f0f' id='52f813b4'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='46303fc6' size-in-bits='1024' id='1ecfc208'>
        <subrange length='8' type-id='7ff19f0f' id='56e0c0b1'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='9788d116' size-in-bits='1344' id='a084573f'>
        <subrange length='7' type-id='7ff19f0f' id='16fc326e'/>
      </array-type-def>
      <array-type-def dimensions='1' type-id='eaa32e2f' size-in-bits='2560' id='788d92df'>
        <subrange length='40' type-id='7ff19f0f' id='8f80b239'/>
      </array-type-def>
      <class-decl name='desc_ptr' size-in-bits='80' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/desc_defs.h' line='112' column='1' id='5848fcd9'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='size' type-id='e280bb54' visibility='default' filepath='arch/x86/include/asm/desc_defs.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='address' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/desc_defs.h' line='114' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='hv_enlightened_vmcs' size-in-bits='8192' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='364' column='1' id='67c96a6b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='revision_id' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='365' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='abort' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='366' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='host_es_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='368' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='80'>
          <var-decl name='host_cs_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='369' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='host_ss_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='370' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='112'>
          <var-decl name='host_ds_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='371' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='host_fs_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='372' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='host_gs_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='373' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='host_tr_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='374' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='176'>
          <var-decl name='padding16_1' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='376' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='host_ia32_pat' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='378' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='host_ia32_efer' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='379' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='host_cr0' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='381' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='host_cr3' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='382' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='host_cr4' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='383' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='host_ia32_sysenter_esp' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='385' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='host_ia32_sysenter_eip' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='386' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='host_rip' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='387' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='host_ia32_sysenter_cs' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='388' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='pin_based_vm_exec_control' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='390' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='vm_exit_controls' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='391' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='800'>
          <var-decl name='secondary_vm_exec_control' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='392' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='io_bitmap_a' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='394' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='io_bitmap_b' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='395' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='msr_bitmap' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='396' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='guest_es_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='398' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1040'>
          <var-decl name='guest_cs_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='399' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1056'>
          <var-decl name='guest_ss_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='400' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1072'>
          <var-decl name='guest_ds_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='401' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='guest_fs_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='402' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1104'>
          <var-decl name='guest_gs_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='403' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1120'>
          <var-decl name='guest_ldtr_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='404' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1136'>
          <var-decl name='guest_tr_selector' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='405' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='guest_es_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='407' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1184'>
          <var-decl name='guest_cs_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='408' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='guest_ss_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='409' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1248'>
          <var-decl name='guest_ds_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='410' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='guest_fs_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='411' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1312'>
          <var-decl name='guest_gs_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='412' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='guest_ldtr_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='413' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1376'>
          <var-decl name='guest_tr_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='414' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='guest_gdtr_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='415' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1440'>
          <var-decl name='guest_idtr_limit' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='416' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='guest_es_ar_bytes' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='418' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1504'>
          <var-decl name='guest_cs_ar_bytes' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='419' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='guest_ss_ar_bytes' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='420' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1568'>
          <var-decl name='guest_ds_ar_bytes' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='421' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='guest_fs_ar_bytes' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='422' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1632'>
          <var-decl name='guest_gs_ar_bytes' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='423' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='guest_ldtr_ar_bytes' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1696'>
          <var-decl name='guest_tr_ar_bytes' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='425' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='guest_es_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='427' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='guest_cs_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='428' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='guest_ss_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='429' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='guest_ds_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='430' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='guest_fs_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='431' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='guest_gs_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='432' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='guest_ldtr_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='433' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='guest_tr_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='434' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='guest_gdtr_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='435' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='guest_idtr_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='436' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='padding64_1' type-id='20a130cf' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='438' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='vm_exit_msr_store_addr' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='440' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='vm_exit_msr_load_addr' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='441' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='vm_entry_msr_load_addr' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='442' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='cr3_target_value0' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='444' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='cr3_target_value1' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='445' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='cr3_target_value2' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='446' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='cr3_target_value3' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='447' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='page_fault_error_code_mask' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='449' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3040'>
          <var-decl name='page_fault_error_code_match' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='450' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='cr3_target_count' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='452' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3104'>
          <var-decl name='vm_exit_msr_store_count' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='453' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3136'>
          <var-decl name='vm_exit_msr_load_count' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='454' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3168'>
          <var-decl name='vm_entry_msr_load_count' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='455' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3200'>
          <var-decl name='tsc_offset' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='457' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3264'>
          <var-decl name='virtual_apic_page_addr' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='458' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3328'>
          <var-decl name='vmcs_link_pointer' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='459' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3392'>
          <var-decl name='guest_ia32_debugctl' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='461' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3456'>
          <var-decl name='guest_ia32_pat' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='462' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3520'>
          <var-decl name='guest_ia32_efer' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='463' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3584'>
          <var-decl name='guest_pdptr0' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='465' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3648'>
          <var-decl name='guest_pdptr1' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='466' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3712'>
          <var-decl name='guest_pdptr2' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='467' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3776'>
          <var-decl name='guest_pdptr3' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='468' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3840'>
          <var-decl name='guest_pending_dbg_exceptions' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='470' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3904'>
          <var-decl name='guest_sysenter_esp' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='471' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3968'>
          <var-decl name='guest_sysenter_eip' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='472' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4032'>
          <var-decl name='guest_activity_state' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='474' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4064'>
          <var-decl name='guest_sysenter_cs' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='475' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4096'>
          <var-decl name='cr0_guest_host_mask' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='477' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4160'>
          <var-decl name='cr4_guest_host_mask' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='478' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4224'>
          <var-decl name='cr0_read_shadow' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='479' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4288'>
          <var-decl name='cr4_read_shadow' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4352'>
          <var-decl name='guest_cr0' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='481' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4416'>
          <var-decl name='guest_cr3' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='482' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4480'>
          <var-decl name='guest_cr4' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='483' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4544'>
          <var-decl name='guest_dr7' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='484' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4608'>
          <var-decl name='host_fs_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='486' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4672'>
          <var-decl name='host_gs_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='487' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4736'>
          <var-decl name='host_tr_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='488' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4800'>
          <var-decl name='host_gdtr_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='489' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4864'>
          <var-decl name='host_idtr_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='490' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4928'>
          <var-decl name='host_rsp' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='491' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4992'>
          <var-decl name='ept_pointer' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='493' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5056'>
          <var-decl name='virtual_processor_id' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='495' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5072'>
          <var-decl name='padding16_2' type-id='02695550' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='496' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5120'>
          <var-decl name='padding64_2' type-id='64af1365' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='498' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5440'>
          <var-decl name='guest_physical_address' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='499' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5504'>
          <var-decl name='vm_instruction_error' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='501' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5536'>
          <var-decl name='vm_exit_reason' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='502' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5568'>
          <var-decl name='vm_exit_intr_info' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='503' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5600'>
          <var-decl name='vm_exit_intr_error_code' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='504' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5632'>
          <var-decl name='idt_vectoring_info_field' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='505' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5664'>
          <var-decl name='idt_vectoring_error_code' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='506' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5696'>
          <var-decl name='vm_exit_instruction_len' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='507' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5728'>
          <var-decl name='vmx_instruction_info' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='508' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5760'>
          <var-decl name='exit_qualification' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='510' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5824'>
          <var-decl name='exit_io_instruction_ecx' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='511' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5888'>
          <var-decl name='exit_io_instruction_esi' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='512' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5952'>
          <var-decl name='exit_io_instruction_edi' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='513' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6016'>
          <var-decl name='exit_io_instruction_eip' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='514' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6080'>
          <var-decl name='guest_linear_address' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='516' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6144'>
          <var-decl name='guest_rsp' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='517' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='guest_rflags' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='518' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6272'>
          <var-decl name='guest_interruptibility_info' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='520' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6304'>
          <var-decl name='cpu_based_vm_exec_control' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='521' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6336'>
          <var-decl name='exception_bitmap' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='522' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6368'>
          <var-decl name='vm_entry_controls' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='523' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6400'>
          <var-decl name='vm_entry_intr_info_field' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='524' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6432'>
          <var-decl name='vm_entry_exception_error_code' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='525' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6464'>
          <var-decl name='vm_entry_instruction_len' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='526' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6496'>
          <var-decl name='tpr_threshold' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='527' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6528'>
          <var-decl name='guest_rip' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='529' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6592'>
          <var-decl name='hv_clean_fields' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='531' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6624'>
          <var-decl name='padding32_1' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='532' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6656'>
          <var-decl name='hv_synthetic_controls' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='533' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6688'>
          <var-decl name='hv_enlightenments_control' type-id='e7f43f72' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='538' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6720'>
          <var-decl name='hv_vp_id' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='539' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6752'>
          <var-decl name='padding32_2' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='540' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6784'>
          <var-decl name='hv_vm_id' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='541' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6848'>
          <var-decl name='partition_assist_page' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='542' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6912'>
          <var-decl name='padding64_4' type-id='20b279f0' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='543' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7168'>
          <var-decl name='guest_bndcfgs' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='544' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7232'>
          <var-decl name='padding64_5' type-id='20aa2b2b' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='545' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7680'>
          <var-decl name='xss_exit_bitmap' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='546' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7744'>
          <var-decl name='padding64_6' type-id='20aa2b2b' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='547' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__91' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='534' column='1' id='e7f43f72'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='nested_flush_hypercall' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='535' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1'>
          <var-decl name='msr_bitmap' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='536' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2'>
          <var-decl name='reserved' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='537' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='hv_partition_assist_pg' size-in-bits='32' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='570' column='1' id='48930924'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='tlb_lock_count' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/hyperv-tlfs.h' line='571' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='io_bitmap' size-in-bits='65664' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/io_bitmap.h' line='8' column='1' id='6bc8aa69'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='sequence' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/io_bitmap.h' line='9' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='refcnt' type-id='64615833' visibility='default' filepath='arch/x86/include/asm/io_bitmap.h' line='10' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='max' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/io_bitmap.h' line='12' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='bitmap' type-id='5ddeb3ad' visibility='default' filepath='arch/x86/include/asm/io_bitmap.h' line='13' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='kvm_mmu_page_role' size-in-bits='32' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='309' column='1' id='857a5575'>
        <data-member access='public'>
          <var-decl name='word' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='310' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='' type-id='e7f43f73' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='311' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__65' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='311' column='1' id='e7f43f73'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='level' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='312' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4'>
          <var-decl name='gpte_is_8_bytes' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='313' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5'>
          <var-decl name='quadrant' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='314' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7'>
          <var-decl name='direct' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='315' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='access' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='316' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11'>
          <var-decl name='invalid' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='317' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12'>
          <var-decl name='efer_nx' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='318' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13'>
          <var-decl name='cr0_wp' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='319' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='14'>
          <var-decl name='smep_andnot_wp' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='320' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15'>
          <var-decl name='smap_andnot_wp' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='321' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='ad_disabled' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='322' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17'>
          <var-decl name='guest_mode' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='323' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='smm' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='332' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='kvm_mmu_extended_role' size-in-bits='32' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='355' column='1' id='8e1796af'>
        <data-member access='public'>
          <var-decl name='word' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='356' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='' type-id='e7f43f74' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='357' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__66' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='357' column='1' id='e7f43f74'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='valid' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='358' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1'>
          <var-decl name='execonly' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='359' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2'>
          <var-decl name='cr0_pg' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='360' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3'>
          <var-decl name='cr4_pae' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='361' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4'>
          <var-decl name='cr4_pse' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='362' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5'>
          <var-decl name='cr4_pke' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='363' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6'>
          <var-decl name='cr4_smap' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='364' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7'>
          <var-decl name='cr4_smep' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='365' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='cr4_la57' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='366' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9'>
          <var-decl name='efer_lma' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='367' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='kvm_mmu_role' size-in-bits='64' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='371' column='1' id='55defaf3'>
        <data-member access='public'>
          <var-decl name='as_u64' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='372' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='' type-id='e7f43f75' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='373' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__64' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='373' column='1' id='e7f43f75'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='base' type-id='857a5575' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='374' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='ext' type-id='8e1796af' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='375' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_rmap_head' size-in-bits='64' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='379' column='1' id='e40c9507'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='val' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='380' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_pio_request' size-in-bits='256' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='383' column='1' id='79474e6a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='linear_rip' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='384' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='count' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='385' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='in' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='386' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='port' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='387' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='size' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='388' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='rsvd_bits_validate' size-in-bits='704' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='393' column='1' id='d6d3c264'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rsvd_bits_mask' type-id='a4295685' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='394' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='bad_mt_xwr' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='395' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_mmu_root_info' size-in-bits='128' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='398' column='1' id='157e158b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='pgd' type-id='f184b22d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='399' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='hpa' type-id='f92d18ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='400' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_mmu' size-in-bits='3200' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='417' column='1' id='a0690c05'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='get_guest_pgd' type-id='6403ec7e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='418' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='get_pdptr' type-id='ca168938' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='419' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='page_fault' type-id='a7377a16' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='420' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='inject_page_fault' type-id='75fec655' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='422' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='gva_to_gpa' type-id='de06a34c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='424' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='translate_gpa' type-id='de06a34c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='426' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='sync_page' type-id='ecb46f30' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='428' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='invlpg' type-id='c725fdd4' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='430' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='root_hpa' type-id='f92d18ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='431' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='root_pgd' type-id='f184b22d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='432' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='mmu_role' type-id='55defaf3' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='433' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='root_level' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='434' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='712'>
          <var-decl name='shadow_root_level' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='435' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='720'>
          <var-decl name='ept_ad' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='436' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='728'>
          <var-decl name='direct_map' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='437' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='prev_roots' type-id='96a42304' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='438' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='permissions' type-id='0d8415b5' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='445' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='pkru_mask' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='453' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='pae_root' type-id='3df9fd28' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='455' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='pml4_root' type-id='3df9fd28' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='456' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='pml5_root' type-id='3df9fd28' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='457' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='shadow_zero_check' type-id='d6d3c264' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='464' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='guest_rsvd_check' type-id='d6d3c264' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='466' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='pdptrs' type-id='20b279f0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='468' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='pmc_type' filepath='arch/x86/include/asm/kvm_host.h' line='476' column='1' id='edb15841'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='KVM_PMC_GP' value='0'/>
        <enumerator name='KVM_PMC_FIXED' value='1'/>
      </enum-decl>
      <class-decl name='kvm_pmc' size-in-bits='448' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='481' column='1' id='39825120'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='type' type-id='edb15841' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='482' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='idx' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='483' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='counter' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='484' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='eventsel' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='485' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='perf_event' type-id='2bf16f59' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='486' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='vcpu' type-id='9dc98dce' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='487' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='current_config' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='492' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='is_paused' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='493' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_pmu' size-in-bits='17472' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='496' column='1' id='4f8273c2'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='nr_arch_gp_counters' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='497' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='nr_arch_fixed_counters' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='498' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='available_event_types' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='499' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='fixed_ctr_ctrl' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='500' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='fixed_ctr_ctrl_mask' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='501' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='global_ctrl' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='502' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='global_status' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='503' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='global_ovf_ctrl' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='504' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='counter_bitmask' type-id='24a375b2' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='505' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='global_ctrl_mask' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='506' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='global_ovf_ctrl_mask' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='507' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='reserved_bits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='508' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='raw_event_mask' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='509' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='version' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='510' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='gp_counters' type-id='60972f2b' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='511' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15232'>
          <var-decl name='fixed_counters' type-id='204d098e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='512' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17024'>
          <var-decl name='irq_work' type-id='9281c70f' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='513' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17216'>
          <var-decl name='reprogram_pmi' type-id='f1257bb3' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='514' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17280'>
          <var-decl name='all_valid_pmc_idx' type-id='f1257bb3' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='515' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17344'>
          <var-decl name='pmc_in_use' type-id='f1257bb3' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='516' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17408'>
          <var-decl name='need_cleanup' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='522' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='17416'>
          <var-decl name='event_count' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='528' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_mtrr_range' size-in-bits='256' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='538' column='1' id='21d52cc3'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='539' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='mask' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='540' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='node' type-id='72f469ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='541' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_mtrr' size-in-bits='2944' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='544' column='1' id='afcc350d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='var_ranges' type-id='ec36648f' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='545' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='fixed_ranges' type-id='e09e99f5' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='546' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='deftype' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='547' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='head' type-id='72f469ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='549' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_vcpu_hv_stimer' size-in-bits='2944' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='553' column='1' id='d95adfa2'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='timer' type-id='b6993efc' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='554' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='index' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='555' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='config' type-id='0027c084' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='556' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='count' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='557' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='exp_time' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='558' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='msg' type-id='07d8b43b' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='559' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='msg_pending' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='560' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_vcpu_hv_synic' size-in-bits='2368' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='564' column='1' id='a3d5e112'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='version' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='565' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='control' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='566' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='msg_page' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='567' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='evt_page' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='568' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='sint' type-id='89ad18bc' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='569' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='sint_to_gsi' type-id='e8e9f1f6' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='570' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='auto_eoi_bitmap' type-id='b51e617a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='571' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='vec_bitmap' type-id='b51e617a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='572' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='active' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='573' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2312'>
          <var-decl name='dont_zero_synic_pages' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='574' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_vcpu_hv' size-in-bits='15232' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='578' column='1' id='c53d3ca3'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='vcpu' type-id='9dc98dce' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='579' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='vp_index' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='580' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='hv_vapic' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='581' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='runtime_offset' type-id='9b7c55ef' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='582' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='synic' type-id='a3d5e112' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='583' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='exit' type-id='5892941d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='584' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3072'>
          <var-decl name='stimer' type-id='50df0408' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='585' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='14848'>
          <var-decl name='stimer_pending_bitmap' type-id='f1257bb3' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='586' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='14912'>
          <var-decl name='tlb_flush' type-id='90bc6bed' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='587' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='14976'>
          <var-decl name='enforce_cpuid' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='588' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15008'>
          <var-decl name='cpuid_cache' type-id='e7f43f76' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='596' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__71' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='589' column='1' id='e7f43f76'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='features_eax' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='590' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='features_ebx' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='591' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='features_edx' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='592' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='enlightenments_eax' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='593' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='enlightenments_ebx' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='594' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='syndbg_cap_eax' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='595' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_vcpu_xen' size-in-bits='1472' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='600' column='1' id='9d12b448'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='hypercall_rip' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='601' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='current_runstate' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='602' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='vcpu_info_set' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='603' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='104'>
          <var-decl name='vcpu_time_info_set' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='604' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='112'>
          <var-decl name='runstate_set' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='605' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='vcpu_info_cache' type-id='489b1b1d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='606' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='vcpu_time_info_cache' type-id='489b1b1d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='607' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='runstate_cache' type-id='489b1b1d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='608' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='last_steal' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='609' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='runstate_entry_time' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='610' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='runstate_times' type-id='20b279f0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='611' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_vcpu_arch' size-in-bits='56896' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='614' column='1' id='aec05ab9'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='regs' type-id='472c2ee4' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='619' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='regs_avail' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='620' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1120'>
          <var-decl name='regs_dirty' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='621' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='cr0' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='623' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='cr0_guest_owned_bits' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='624' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='cr2' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='625' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='cr3' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='626' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='cr4' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='627' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='cr4_guest_owned_bits' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='628' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='cr4_guest_rsvd_bits' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='629' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='cr8' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='630' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='host_pkru' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='631' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1696'>
          <var-decl name='pkru' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='632' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='hflags' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='633' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='efer' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='634' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='apic_base' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='635' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='apic' type-id='fd4429f9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='636' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='apicv_active' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='637' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1992'>
          <var-decl name='load_eoi_exitmap_pending' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='638' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='ioapic_handled_vectors' type-id='b51e617a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='639' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='apic_attention' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='640' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='apic_arb_prio' type-id='3ff5601b' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='641' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2400'>
          <var-decl name='mp_state' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='642' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='ia32_misc_enable_msr' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='643' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='smbase' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='644' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='smi_count' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='645' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='at_instruction_boundary' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='646' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2632'>
          <var-decl name='tpr_access_reporting' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='647' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2640'>
          <var-decl name='xsaves_enabled' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='648' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='ia32_xss' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='649' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='microcode_version' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='650' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='arch_capabilities' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='651' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2880'>
          <var-decl name='perf_capabilities' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='652' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2944'>
          <var-decl name='mmu' type-id='b4b7e335' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='661' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3008'>
          <var-decl name='root_mmu' type-id='a0690c05' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='664' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6208'>
          <var-decl name='guest_mmu' type-id='a0690c05' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='667' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='9408'>
          <var-decl name='nested_mmu' type-id='a0690c05' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='677' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12608'>
          <var-decl name='walk_mmu' type-id='b4b7e335' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='683' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12672'>
          <var-decl name='mmu_pte_list_desc_cache' type-id='4bff33c0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='685' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15360'>
          <var-decl name='mmu_shadow_page_cache' type-id='4bff33c0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='686' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='18048'>
          <var-decl name='mmu_gfn_array_cache' type-id='4bff33c0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='687' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='20736'>
          <var-decl name='mmu_page_header_cache' type-id='4bff33c0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='688' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23424'>
          <var-decl name='user_fpu' type-id='75ad8790' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='701' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23488'>
          <var-decl name='guest_fpu' type-id='75ad8790' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='702' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23552'>
          <var-decl name='xcr0' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='704' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23616'>
          <var-decl name='guest_supported_xcr0' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='705' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23680'>
          <var-decl name='pio' type-id='79474e6a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='707' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='23936'>
          <var-decl name='pio_data' type-id='eaa32e2f' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='708' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24000'>
          <var-decl name='sev_pio_data' type-id='eaa32e2f' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='709' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24064'>
          <var-decl name='sev_pio_count' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='710' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24096'>
          <var-decl name='event_exit_inst_len' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='712' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24128'>
          <var-decl name='exception' type-id='af19b66f' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='723' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24320'>
          <var-decl name='interrupt' type-id='2f4163e9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='729' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24352'>
          <var-decl name='halt_request' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='731' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24384'>
          <var-decl name='cpuid_nent' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='733' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24448'>
          <var-decl name='cpuid_entries' type-id='31eed474' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='734' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24512'>
          <var-decl name='reserved_gpa_bits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='736' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24576'>
          <var-decl name='maxphyaddr' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='737' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24640'>
          <var-decl name='emulate_ctxt' type-id='7f45c7af' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='741' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24704'>
          <var-decl name='emulate_regs_need_sync_to_vcpu' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='742' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24712'>
          <var-decl name='emulate_regs_need_sync_from_vcpu' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='743' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24768'>
          <var-decl name='complete_userspace_io' type-id='03e171d0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='744' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24832'>
          <var-decl name='time' type-id='f184b22d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='746' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24896'>
          <var-decl name='hv_clock' type-id='b602015d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='747' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25152'>
          <var-decl name='hw_tsc_khz' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='748' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25216'>
          <var-decl name='pv_time' type-id='489b1b1d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='749' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25536'>
          <var-decl name='pv_time_enabled' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='750' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25544'>
          <var-decl name='pvclock_set_guest_stopped_request' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='752' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='25600'>
          <var-decl name='st' type-id='e7f43f77' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='759' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26112'>
          <var-decl name='l1_tsc_offset' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='761' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26176'>
          <var-decl name='tsc_offset' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='762' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26240'>
          <var-decl name='last_guest_tsc' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='763' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26304'>
          <var-decl name='last_host_tsc' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='764' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26368'>
          <var-decl name='tsc_offset_adjustment' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='765' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26432'>
          <var-decl name='this_tsc_nsec' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='766' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26496'>
          <var-decl name='this_tsc_write' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='767' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26560'>
          <var-decl name='this_tsc_generation' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='768' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26624'>
          <var-decl name='tsc_catchup' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='769' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26632'>
          <var-decl name='tsc_always_catchup' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='770' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26640'>
          <var-decl name='virtual_tsc_shift' type-id='fdbf7a0f' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='771' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26656'>
          <var-decl name='virtual_tsc_mult' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='772' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26688'>
          <var-decl name='virtual_tsc_khz' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='773' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26752'>
          <var-decl name='ia32_tsc_adjust_msr' type-id='9b7c55ef' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='774' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26816'>
          <var-decl name='msr_ia32_power_ctl' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='775' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26880'>
          <var-decl name='l1_tsc_scaling_ratio' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='776' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='26944'>
          <var-decl name='tsc_scaling_ratio' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='777' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27008'>
          <var-decl name='nmi_queued' type-id='49178f86' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='779' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27040'>
          <var-decl name='nmi_pending' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='780' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27072'>
          <var-decl name='nmi_injected' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='781' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27080'>
          <var-decl name='smi_pending' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='782' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27088'>
          <var-decl name='handling_intr_from_guest' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='783' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='27136'>
          <var-decl name='mtrr_state' type-id='afcc350d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='785' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30080'>
          <var-decl name='pat' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='786' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30144'>
          <var-decl name='switch_db_regs' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='788' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30208'>
          <var-decl name='db' type-id='b51e617a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='789' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30464'>
          <var-decl name='dr6' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='790' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30528'>
          <var-decl name='dr7' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='791' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30592'>
          <var-decl name='eff_db' type-id='b51e617a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='792' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30848'>
          <var-decl name='guest_debug_dr7' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='793' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30912'>
          <var-decl name='msr_platform_info' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='794' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='30976'>
          <var-decl name='msr_misc_features_enables' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='795' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31040'>
          <var-decl name='mcg_cap' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='797' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31104'>
          <var-decl name='mcg_status' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='798' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31168'>
          <var-decl name='mcg_ctl' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='799' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31232'>
          <var-decl name='mcg_ext_ctl' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='800' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31296'>
          <var-decl name='mce_banks' type-id='3df9fd28' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='801' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31360'>
          <var-decl name='mmio_gva' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='804' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31424'>
          <var-decl name='mmio_access' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='805' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31488'>
          <var-decl name='mmio_gfn' type-id='b05bb00a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='806' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31552'>
          <var-decl name='mmio_gen' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='807' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='31616'>
          <var-decl name='pmu' type-id='4f8273c2' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='809' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='49088'>
          <var-decl name='singlestep_rip' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='812' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='49152'>
          <var-decl name='hyperv_enabled' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='814' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='49216'>
          <var-decl name='hyperv' type-id='8407c163' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='815' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='49280'>
          <var-decl name='xen' type-id='9d12b448' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='816' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='50752'>
          <var-decl name='wbinvd_dirty_mask' type-id='b16b461b' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='818' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='50816'>
          <var-decl name='last_retry_eip' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='820' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='50880'>
          <var-decl name='last_retry_addr' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='821' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='50944'>
          <var-decl name='apf' type-id='e7f43f78' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='836' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='55808'>
          <var-decl name='osvw' type-id='e7f43f79' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='842' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='55936'>
          <var-decl name='pv_eoi' type-id='e7f43f7a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='847' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56320'>
          <var-decl name='msr_kvm_poll_control' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='849' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56384'>
          <var-decl name='write_fault_to_shadow_pgtable' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='866' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56448'>
          <var-decl name='exit_qualification' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='869' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56512'>
          <var-decl name='pv' type-id='e7f43f7b' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='874' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56544'>
          <var-decl name='pending_ioapic_eoi' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='876' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56576'>
          <var-decl name='pending_external_vector' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='877' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56608'>
          <var-decl name='preempted_in_kernel' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='880' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56616'>
          <var-decl name='l1tf_flush_l1d' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='883' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56640'>
          <var-decl name='last_vmentry_cpu' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='886' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56704'>
          <var-decl name='msr_hwcr' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='889' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56768'>
          <var-decl name='pv_cpuid' type-id='e7f43f7c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='904' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56832'>
          <var-decl name='guest_state_protected' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='907' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56840'>
          <var-decl name='pdptrs_from_userspace' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='913' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_queued_exception' size-in-bits='192' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='714' column='1' id='af19b66f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='pending' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='715' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='injected' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='716' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='has_error_code' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='717' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='nr' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='718' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='error_code' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='719' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='payload' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='720' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='has_payload' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='721' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='136'>
          <var-decl name='nested_apf' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='722' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_queued_interrupt' size-in-bits='24' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='725' column='1' id='2f4163e9'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='injected' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='726' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='soft' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='727' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='nr' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='728' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__67' size-in-bits='512' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='754' column='1' id='e7f43f77'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='preempted' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='755' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='msr_val' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='756' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='last_steal' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='757' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='cache' type-id='489b1b1d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='758' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__72' size-in-bits='4864' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='823' column='1' id='e7f43f78'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='halted' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='824' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='gfns' type-id='a66924eb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='825' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4160'>
          <var-decl name='data' type-id='489b1b1d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='826' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4480'>
          <var-decl name='msr_en_val' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='827' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4544'>
          <var-decl name='msr_int_val' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='828' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4608'>
          <var-decl name='vec' type-id='1dc6a898' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='829' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4640'>
          <var-decl name='id' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='830' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4672'>
          <var-decl name='send_user_only' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='831' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4704'>
          <var-decl name='host_apf_flags' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='832' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4736'>
          <var-decl name='nested_apf_token' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='833' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4800'>
          <var-decl name='delivery_as_pf_vmexit' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='834' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4808'>
          <var-decl name='pageready_pending' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='835' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__73' size-in-bits='128' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='839' column='1' id='e7f43f79'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='length' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='840' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='status' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='841' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__74' size-in-bits='384' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='844' column='1' id='e7f43f7a'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='msr_val' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='845' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='data' type-id='489b1b1d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='846' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__75' size-in-bits='8' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='872' column='1' id='e7f43f7b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='pv_unhalted' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='873' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__76' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='892' column='1' id='e7f43f7c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='features' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='897' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='enforce' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='903' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_lpage_info' size-in-bits='32' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='920' column='1' id='b71177e8'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='disallow_lpage' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='921' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_arch_memory_slot' size-in-bits='384' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='924' column='1' id='7161d8ab'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rmap' type-id='691f9b70' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='925' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='lpage_info' type-id='47b495de' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='926' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='gfn_track' type-id='0349d241' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='927' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_apic_map' size-in-bits='4288' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='941' column='1' id='d636fd90'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rcu' type-id='e3d8ce29' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='942' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='mode' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='943' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='max_apic_id' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='944' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='' type-id='ac5ab595' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='945' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4288'>
          <var-decl name='phys_map' type-id='1110cd41' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='949' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__45' size-in-bits='4096' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='945' column='1' id='ac5ab595'>
        <data-member access='public'>
          <var-decl name='xapic_flat_map' type-id='fd2b8645' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='946' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='xapic_cluster_map' type-id='9cb3420a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='947' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='kvm_hv_syndbg' size-in-bits='384' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='953' column='1' id='eacdc742'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='control' type-id='e7f43f7d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='960' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='options' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='961' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__31' size-in-bits='320' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='954' column='1' id='e7f43f7d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='control' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='955' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='status' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='956' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='send_page' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='957' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='recv_page' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='958' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='pending_page' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='959' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='hv_tsc_page_status' filepath='arch/x86/include/asm/kvm_host.h' line='965' column='1' id='e4bef716'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='HV_TSC_PAGE_UNSET' value='0'/>
        <enumerator name='HV_TSC_PAGE_GUEST_CHANGED' value='1'/>
        <enumerator name='HV_TSC_PAGE_HOST_CHANGED' value='2'/>
        <enumerator name='HV_TSC_PAGE_SET' value='3'/>
        <enumerator name='HV_TSC_PAGE_UPDATING' value='4'/>
        <enumerator name='HV_TSC_PAGE_BROKEN' value='5'/>
      </enum-decl>
      <class-decl name='kvm_hv' size-in-bits='2112' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='981' column='1' id='67dff216'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='hv_lock' type-id='925167dc' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='982' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='hv_guest_os_id' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='983' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='hv_hypercall' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='984' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='hv_tsc_page' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='985' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='hv_tsc_page_status' type-id='e4bef716' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='986' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='hv_crash_param' type-id='64af1365' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='989' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='hv_crash_ctl' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='990' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='tsc_ref' type-id='cc432b27' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='992' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='conn_to_evt' type-id='37ce495e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='994' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='hv_reenlightenment_control' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='996' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='hv_tsc_emulation_control' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='997' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='hv_tsc_emulation_status' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='998' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='num_mismatched_vp_indexes' type-id='49178f86' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1001' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1632'>
          <var-decl name='synic_auto_eoi_used' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1007' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='hv_pa_pg' type-id='068cf012' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1009' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='hv_syndbg' type-id='eacdc742' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1010' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='msr_bitmap_range' size-in-bits='192' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1013' column='1' id='e50f5e97'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='flags' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1014' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='nmsrs' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1015' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='base' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1016' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='bitmap' type-id='a163c962' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1017' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_xen' size-in-bits='128' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1021' column='1' id='ad2cd437'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='long_mode' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1022' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='upcall_vector' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1023' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='shinfo_gfn' type-id='b05bb00a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1024' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='kvm_irqchip_mode' filepath='arch/x86/include/asm/kvm_host.h' line='1027' column='1' id='66b48e27'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='KVM_IRQCHIP_NONE' value='0'/>
        <enumerator name='KVM_IRQCHIP_KERNEL' value='1'/>
        <enumerator name='KVM_IRQCHIP_SPLIT' value='2'/>
      </enum-decl>
      <class-decl name='kvm_x86_msr_filter' size-in-bits='3136' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1033' column='1' id='d258e2a6'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='count' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1034' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='default_allow' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1035' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='ranges' type-id='1e971f6a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1036' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_arch' size-in-bits='277248' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1046' column='1' id='4eec799c'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='n_used_mmu_pages' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1047' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='n_requested_mmu_pages' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1048' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='n_max_mmu_pages' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1049' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='indirect_shadow_pages' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1050' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='mmu_valid_gen' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1051' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='mmu_page_hash' type-id='45381fab' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1052' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='262400'>
          <var-decl name='active_mmu_pages' type-id='72f469ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1053' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='262528'>
          <var-decl name='zapped_obsolete_pages' type-id='72f469ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1054' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='262656'>
          <var-decl name='lpage_disallowed_mmu_pages' type-id='72f469ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1055' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='262784'>
          <var-decl name='mmu_sp_tracker' type-id='963788df' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1056' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='263040'>
          <var-decl name='track_notifier_head' type-id='3cbe34e5' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1057' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='268672'>
          <var-decl name='mmu_unsync_pages_lock' type-id='fb4018a0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1064' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='268736'>
          <var-decl name='assigned_dev_head' type-id='72f469ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1066' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='268864'>
          <var-decl name='iommu_domain' type-id='bff05edb' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1067' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='268928'>
          <var-decl name='iommu_noncoherent' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1068' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='268960'>
          <var-decl name='noncoherent_dma_count' type-id='49178f86' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1070' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='268992'>
          <var-decl name='assigned_device_count' type-id='49178f86' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1072' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='269056'>
          <var-decl name='vpic' type-id='dba8f6b2' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1073' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='269120'>
          <var-decl name='vioapic' type-id='3674f2c9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1074' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='269184'>
          <var-decl name='vpit' type-id='55ce8799' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1075' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='269248'>
          <var-decl name='vapics_in_nmi_mode' type-id='49178f86' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1076' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='269312'>
          <var-decl name='apic_map_lock' type-id='925167dc' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1077' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='269696'>
          <var-decl name='apic_map' type-id='09cb1ec6' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1078' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='269760'>
          <var-decl name='apic_map_dirty' type-id='49178f86' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1079' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='269824'>
          <var-decl name='apicv_update_lock' type-id='925167dc' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1082' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270208'>
          <var-decl name='apic_access_memslot_enabled' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1084' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270272'>
          <var-decl name='apicv_inhibit_reasons' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1085' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270336'>
          <var-decl name='wall_clock' type-id='f184b22d' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1087' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270400'>
          <var-decl name='mwait_in_guest' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1089' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270408'>
          <var-decl name='hlt_in_guest' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1090' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270416'>
          <var-decl name='pause_in_guest' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1091' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270424'>
          <var-decl name='cstate_in_guest' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1092' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270464'>
          <var-decl name='irq_sources_bitmap' type-id='3aa0f67c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1094' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270528'>
          <var-decl name='kvmclock_offset' type-id='9b7c55ef' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1095' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270592'>
          <var-decl name='tsc_write_lock' type-id='f5c90b3f' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1096' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270656'>
          <var-decl name='last_tsc_nsec' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1097' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270720'>
          <var-decl name='last_tsc_write' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1098' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270784'>
          <var-decl name='last_tsc_khz' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1099' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270848'>
          <var-decl name='cur_tsc_nsec' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1100' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270912'>
          <var-decl name='cur_tsc_write' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1101' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='270976'>
          <var-decl name='cur_tsc_offset' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1102' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='271040'>
          <var-decl name='cur_tsc_generation' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1103' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='271104'>
          <var-decl name='nr_vcpus_matched_tsc' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1104' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='271136'>
          <var-decl name='pvclock_gtod_sync_lock' type-id='f5c90b3f' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1106' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='271168'>
          <var-decl name='use_master_clock' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1107' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='271232'>
          <var-decl name='master_kernel_ns' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1108' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='271296'>
          <var-decl name='master_cycle_now' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1109' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='271360'>
          <var-decl name='kvmclock_update_work' type-id='5ad6e0ef' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1110' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='272448'>
          <var-decl name='kvmclock_sync_work' type-id='5ad6e0ef' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1111' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='273536'>
          <var-decl name='xen_hvm_config' type-id='5a3312f0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='273984'>
          <var-decl name='mask_notifier_list' type-id='e151255a' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1116' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='274048'>
          <var-decl name='hyperv' type-id='67dff216' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1118' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276160'>
          <var-decl name='xen' type-id='ad2cd437' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1119' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276288'>
          <var-decl name='backwards_tsc_observed' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1125' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276296'>
          <var-decl name='boot_vcpu_runs_old_kvmclock' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1126' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276320'>
          <var-decl name='bsp_vcpu_id' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1127' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276352'>
          <var-decl name='disabled_quirks' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1129' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276416'>
          <var-decl name='cpu_dirty_logging_count' type-id='95e97e5e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1130' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276448'>
          <var-decl name='irqchip_mode' type-id='66b48e27' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1132' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276480'>
          <var-decl name='nr_reserved_ioapic_pins' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1133' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276488'>
          <var-decl name='disabled_lapic_found' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1135' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276496'>
          <var-decl name='x2apic_format' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1137' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276504'>
          <var-decl name='x2apic_broadcast_quirk_disabled' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276512'>
          <var-decl name='guest_can_read_msr_platform_info' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1140' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276520'>
          <var-decl name='exception_payload_enabled' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1141' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276528'>
          <var-decl name='bus_lock_detection_enabled' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1143' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276536'>
          <var-decl name='exit_on_emulation_error' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1149' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276544'>
          <var-decl name='user_space_msr_mask' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1152' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276608'>
          <var-decl name='msr_filter' type-id='498773dc' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276672'>
          <var-decl name='hypercall_exit_enabled' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1155' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276704'>
          <var-decl name='sgx_provisioning_allowed' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1158' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276736'>
          <var-decl name='pmu_event_filter' type-id='32bc768e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1160' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276800'>
          <var-decl name='nx_lpage_recovery_thread' type-id='f23e2572' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1161' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276864'>
          <var-decl name='tdp_mmu_enabled' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1171' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='276928'>
          <var-decl name='tdp_mmu_roots' type-id='72f469ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1191' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='277056'>
          <var-decl name='tdp_mmu_pages' type-id='72f469ec' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1198' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='277184'>
          <var-decl name='tdp_mmu_pages_lock' type-id='fb4018a0' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1212' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='277216'>
          <var-decl name='memslots_have_rmaps' type-id='b50a4934' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1219' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_vm_stat' size-in-bits='960' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1227' column='1' id='b4714cb0'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='generic' type-id='42109042' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1228' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='mmu_shadow_zapped' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1229' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='mmu_pte_write' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1230' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='mmu_pde_zapped' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1231' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='mmu_flooded' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1232' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='mmu_recycled' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1233' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='mmu_cache_miss' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1234' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='mmu_unsync' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1235' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='' type-id='ac5ab596' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1236' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='nx_lpage_splits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1244' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='max_mmu_page_hash_collisions' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1245' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='max_mmu_rmap_size' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1246' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__44' size-in-bits='192' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1236' column='1' id='ac5ab596'>
        <data-member access='public'>
          <var-decl name='' type-id='e7f43f7e' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1237' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='pages' type-id='fdeae366' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1242' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__30' size-in-bits='192' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1237' column='1' id='e7f43f7e'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='pages_4k' type-id='28ee064c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1238' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pages_2m' type-id='28ee064c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1239' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='pages_1g' type-id='28ee064c' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1240' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_vcpu_stat' size-in-bits='8384' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1249' column='1' id='72c737c7'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='generic' type-id='940ac545' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1250' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6592'>
          <var-decl name='pf_fixed' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1251' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6656'>
          <var-decl name='pf_guest' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1252' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6720'>
          <var-decl name='tlb_flush' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1253' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6784'>
          <var-decl name='invlpg' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1254' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6848'>
          <var-decl name='exits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1256' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6912'>
          <var-decl name='io_exits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1257' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='6976'>
          <var-decl name='mmio_exits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1258' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7040'>
          <var-decl name='signal_exits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1259' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7104'>
          <var-decl name='irq_window_exits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1260' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7168'>
          <var-decl name='nmi_window_exits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1261' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7232'>
          <var-decl name='l1d_flush' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1262' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7296'>
          <var-decl name='halt_exits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1263' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7360'>
          <var-decl name='request_irq_exits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1264' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7424'>
          <var-decl name='irq_exits' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1265' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7488'>
          <var-decl name='host_state_reload' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1266' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7552'>
          <var-decl name='fpu_reload' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1267' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7616'>
          <var-decl name='insn_emulation' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1268' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7680'>
          <var-decl name='insn_emulation_fail' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1269' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7744'>
          <var-decl name='hypercalls' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1270' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7808'>
          <var-decl name='irq_injections' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1271' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7872'>
          <var-decl name='nmi_injections' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1272' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='7936'>
          <var-decl name='req_event' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1273' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8000'>
          <var-decl name='nested_run' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1274' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8064'>
          <var-decl name='directed_yield_attempted' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1275' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8128'>
          <var-decl name='directed_yield_successful' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1276' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8192'>
          <var-decl name='preemption_reported' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1277' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8256'>
          <var-decl name='preemption_other' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1278' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8320'>
          <var-decl name='guest_mode' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/kvm_host.h' line='1279' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_page_track_notifier_head' size-in-bits='5632' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_page_track.h' line='17' column='1' id='3cbe34e5'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='track_srcu' type-id='e4a7867c' visibility='default' filepath='arch/x86/include/asm/kvm_page_track.h' line='18' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5568'>
          <var-decl name='track_notifier_list' type-id='e151255a' visibility='default' filepath='arch/x86/include/asm/kvm_page_track.h' line='19' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_page_track_notifier_node' size-in-bits='256' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/kvm_page_track.h' line='22' column='1' id='963788df'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='node' type-id='03a4a074' visibility='default' filepath='arch/x86/include/asm/kvm_page_track.h' line='23' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='track_write' type-id='d851b4bc' visibility='default' filepath='arch/x86/include/asm/kvm_page_track.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='track_flush_slot' type-id='7db3fe65' visibility='default' filepath='arch/x86/include/asm/kvm_page_track.h' line='45' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='x86_msi_data' size-in-bits='32' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/msi.h' line='14' column='1' id='e1dcdb92'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='ac5ab597' visibility='default' filepath='arch/x86/include/asm/msi.h' line='15' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__20' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/msi.h' line='15' column='1' id='ac5ab597'>
        <data-member access='public'>
          <var-decl name='' type-id='e7f43f7f' visibility='default' filepath='arch/x86/include/asm/msi.h' line='16' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='dmar_subhandle' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='24' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__11' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/msi.h' line='16' column='1' id='e7f43f7f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='vector' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='17' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='delivery_mode' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='18' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='11'>
          <var-decl name='dest_mode_logical' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='19' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12'>
          <var-decl name='reserved' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='20' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='14'>
          <var-decl name='active_low' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='21' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='15'>
          <var-decl name='is_level' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='22' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='arch_msi_msg_data_t' type-id='e1dcdb92' filepath='arch/x86/include/asm/msi.h' line='26' column='1' id='3e0ab710'/>
      <class-decl name='x86_msi_addr_lo' size-in-bits='32' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/msi.h' line='29' column='1' id='671e05a7'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='' type-id='ac5ab598' visibility='default' filepath='arch/x86/include/asm/msi.h' line='30' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__17' size-in-bits='32' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/msi.h' line='30' column='1' id='ac5ab598'>
        <data-member access='public'>
          <var-decl name='' type-id='e7f43f80' visibility='default' filepath='arch/x86/include/asm/msi.h' line='31' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='' type-id='e7f43f81' visibility='default' filepath='arch/x86/include/asm/msi.h' line='40' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='__anonymous_struct__9' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/msi.h' line='31' column='1' id='e7f43f80'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='reserved_0' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2'>
          <var-decl name='dest_mode_logical' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3'>
          <var-decl name='redirect_hint' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4'>
          <var-decl name='reserved_1' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5'>
          <var-decl name='virt_destid_8_14' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='12'>
          <var-decl name='destid_0_7' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='20'>
          <var-decl name='base_address' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='38' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__10' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/asm/msi.h' line='40' column='1' id='e7f43f81'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='dmar_reserved_0' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2'>
          <var-decl name='dmar_index_15' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='42' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3'>
          <var-decl name='dmar_subhandle_valid' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4'>
          <var-decl name='dmar_format' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='5'>
          <var-decl name='dmar_index_0_14' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='20'>
          <var-decl name='dmar_base_address' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='46' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='arch_msi_msg_addr_lo_t' type-id='671e05a7' filepath='arch/x86/include/asm/msi.h' line='49' column='1' id='0c8751d3'/>
      <class-decl name='x86_msi_addr_hi' size-in-bits='32' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/msi.h' line='54' column='1' id='4d14e25d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='reserved' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='55' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='destid_8_31' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/msi.h' line='56' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='arch_msi_msg_addr_hi_t' type-id='4d14e25d' filepath='arch/x86/include/asm/msi.h' line='57' column='1' id='6a36f05d'/>
      <class-decl name='x86_pmu_lbr' size-in-bits='128' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/perf_event.h' line='477' column='1' id='88865a6f'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='nr' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/perf_event.h' line='478' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='from' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/perf_event.h' line='479' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='to' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/perf_event.h' line='480' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='info' type-id='f0981eeb' visibility='default' filepath='arch/x86/include/asm/perf_event.h' line='481' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='pvclock_vcpu_time_info' size-in-bits='256' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/pvclock-abi.h' line='26' column='1' id='b602015d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='version' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/pvclock-abi.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='pad0' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/pvclock-abi.h' line='28' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='tsc_timestamp' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/pvclock-abi.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='system_time' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/pvclock-abi.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='tsc_to_system_mul' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/pvclock-abi.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='tsc_shift' type-id='fdbf7a0f' visibility='default' filepath='arch/x86/include/asm/pvclock-abi.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='232'>
          <var-decl name='flags' type-id='f9b06939' visibility='default' filepath='arch/x86/include/asm/pvclock-abi.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='240'>
          <var-decl name='pad' type-id='cf114704' visibility='default' filepath='arch/x86/include/asm/pvclock-abi.h' line='34' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='vmx_msr_entry' size-in-bits='128' is-struct='yes' visibility='default' filepath='arch/x86/include/asm/vmx.h' line='524' column='1' id='46303fc6'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='index' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/vmx.h' line='525' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='reserved' type-id='19c2251e' visibility='default' filepath='arch/x86/include/asm/vmx.h' line='526' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='value' type-id='91ce1af9' visibility='default' filepath='arch/x86/include/asm/vmx.h' line='527' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_regs' size-in-bits='1152' is-struct='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='118' column='1' id='b28fa7ef'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='rax' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='120' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='rbx' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='120' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='rcx' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='120' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='rdx' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='120' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='rsi' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='rdi' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='rsp' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='rbp' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='121' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='r8' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='122' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='r9' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='122' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='r10' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='122' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='r11' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='122' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='r12' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='r13' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='r14' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='r15' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='123' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='rip' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='124' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='rflags' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='124' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_segment' size-in-bits='192' is-struct='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='133' column='1' id='272aff5d'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='base' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='134' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='limit' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='135' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='selector' type-id='d315442e' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='136' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='112'>
          <var-decl name='type' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='137' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='120'>
          <var-decl name='present' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='dpl' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='136'>
          <var-decl name='db' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='144'>
          <var-decl name='s' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='152'>
          <var-decl name='l' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='g' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='168'>
          <var-decl name='avl' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='138' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='176'>
          <var-decl name='unusable' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='139' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='184'>
          <var-decl name='padding' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='140' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_dtable' size-in-bits='128' is-struct='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='143' column='1' id='a59a9764'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='base' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='144' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='limit' type-id='d315442e' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='145' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='80'>
          <var-decl name='padding' type-id='450d2a3a' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='146' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_sregs' size-in-bits='2496' is-struct='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='151' column='1' id='1e413f82'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='cs' type-id='272aff5d' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='ds' type-id='272aff5d' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='es' type-id='272aff5d' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='fs' type-id='272aff5d' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='gs' type-id='272aff5d' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='ss' type-id='272aff5d' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='153' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='tr' type-id='272aff5d' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='154' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='ldt' type-id='272aff5d' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='154' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='gdt' type-id='a59a9764' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='155' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='idt' type-id='a59a9764' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='155' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='cr0' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='156' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='cr2' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='156' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='cr3' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='156' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='cr4' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='156' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='cr8' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='156' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='efer' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='157' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='apic_base' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='158' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='interrupt_bitmap' type-id='ce805d5e' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='159' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_cpuid_entry2' size-in-bits='320' is-struct='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='247' column='1' id='d93281ae'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='function' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='248' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='index' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='249' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='250' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='eax' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='251' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='ebx' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='252' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='ecx' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='253' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='edx' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='254' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='padding' type-id='3fa05d14' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='255' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_debug_exit_arch' size-in-bits='256' is-struct='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='286' column='1' id='1daa2a45'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='exception' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='287' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='pad' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='288' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pc' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='289' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='dr6' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='290' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='dr7' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='291' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_vcpu_events' size-in-bits='512' is-struct='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='334' column='1' id='72537974'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='exception' type-id='e7f43f82' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='341' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='interrupt' type-id='e7f43f83' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='347' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='nmi' type-id='e7f43f84' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='353' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='sipi_vector' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='354' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='160'>
          <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='355' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='smi' type-id='e7f43f85' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='361' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='224'>
          <var-decl name='reserved' type-id='26e9ba97' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='362' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='440'>
          <var-decl name='exception_has_payload' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='363' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='exception_payload' type-id='d3130597' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='364' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__58' size-in-bits='64' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='335' column='1' id='e7f43f82'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='injected' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='336' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='nr' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='337' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='has_error_code' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='338' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='pending' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='339' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='error_code' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='340' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__59' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='342' column='1' id='e7f43f83'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='injected' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='343' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='nr' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='344' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='soft' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='345' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='shadow' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='346' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__60' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='348' column='1' id='e7f43f84'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='injected' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='349' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='pending' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='350' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='masked' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='351' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='pad' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='352' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='__anonymous_struct__61' size-in-bits='32' is-struct='yes' is-anonymous='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='356' column='1' id='e7f43f85'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='smm' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='357' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='pending' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='358' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='smm_inside_nmi' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='359' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='latched_init' type-id='8f048e17' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='360' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_sync_regs' size-in-bits='4160' is-struct='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='406' column='1' id='6d026d23'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='regs' type-id='b28fa7ef' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='412' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='sregs' type-id='1e413f82' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='413' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3648'>
          <var-decl name='events' type-id='72537974' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='414' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_pmu_event_filter' size-in-bits='256' is-struct='yes' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='495' column='1' id='fe22a408'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='action' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='496' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='nevents' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='497' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='fixed_counter_bitmap' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='498' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='flags' type-id='3f1a6b60' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='499' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='pad' type-id='3fa29bab' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='500' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='events' type-id='52cd3f2c' visibility='default' filepath='arch/x86/include/uapi/asm/kvm.h' line='501' column='1'/>
        </data-member>
      </class-decl>
      <typedef-decl name='mtrr_type' type-id='8f048e17' filepath='arch/x86/include/uapi/asm/mtrr.h' line='79' column='1' id='4d29a16e'/>
      <typedef-decl name='sse128_t' type-id='1c6c0c39' filepath='arch/x86/kvm/fpu.h' line='8' column='1' id='94954185'/>
      <class-decl name='kvm_kpic_state' size-in-bits='256' is-struct='yes' visibility='default' filepath='arch/x86/kvm/irq.h' line='28' column='1' id='c8a1e3d1'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='last_irr' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='29' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='irr' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='30' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='imr' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='isr' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='priority_add' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='40'>
          <var-decl name='irq_base' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='48'>
          <var-decl name='read_reg_select' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='56'>
          <var-decl name='poll' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='special_mask' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='72'>
          <var-decl name='init_state' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='80'>
          <var-decl name='auto_eoi' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='88'>
          <var-decl name='rotate_on_auto_eoi' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='40' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='special_fully_nested_mode' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='104'>
          <var-decl name='init4' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='42' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='112'>
          <var-decl name='elcr' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='120'>
          <var-decl name='elcr_mask' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='isr_ack' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/irq.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='pics_state' type-id='dba8f6b2' visibility='default' filepath='arch/x86/kvm/irq.h' line='46' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_pic' size-in-bits='1984' is-struct='yes' visibility='default' filepath='arch/x86/kvm/irq.h' line='49' column='1' id='518b7144'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='lock' type-id='fb4018a0' visibility='default' filepath='arch/x86/kvm/irq.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='wakeup_needed' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/irq.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='pending_acks' type-id='f0981eeb' visibility='default' filepath='arch/x86/kvm/irq.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='kvm' type-id='c24bb303' visibility='default' filepath='arch/x86/kvm/irq.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='pics' type-id='2dc8a603' visibility='default' filepath='arch/x86/kvm/irq.h' line='54' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='output' type-id='95e97e5e' visibility='default' filepath='arch/x86/kvm/irq.h' line='55' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='dev_master' type-id='cc81b603' visibility='default' filepath='arch/x86/kvm/irq.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='dev_slave' type-id='cc81b603' visibility='default' filepath='arch/x86/kvm/irq.h' line='57' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='dev_elcr' type-id='cc81b603' visibility='default' filepath='arch/x86/kvm/irq.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='irq_states' type-id='8b2a5b59' visibility='default' filepath='arch/x86/kvm/irq.h' line='59' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='x86_exception' size-in-bits='192' is-struct='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='22' column='1' id='5eefb59b'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='vector' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='23' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='error_code_valid' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='24' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='error_code' type-id='1dc6a898' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='25' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='nested_page_fault' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='26' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='address' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='27' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='async_page_fault' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='28' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='x86_instruction_info' size-in-bits='320' is-struct='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='36' column='1' id='3f379627'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='intercept' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8'>
          <var-decl name='rep_prefix' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='16'>
          <var-decl name='modrm_mod' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='24'>
          <var-decl name='modrm_reg' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='40' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='modrm_rm' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='src_val' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='42' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='dst_val' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='43' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='src_bytes' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='44' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='200'>
          <var-decl name='dst_bytes' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='45' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='208'>
          <var-decl name='ad_bytes' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='46' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='next_rip' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='47' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='x86_emulate_ops' size-in-bits='2880' is-struct='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='91' column='1' id='4ad8ed98'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='read_gpr' type-id='d93e8eda' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='97' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='write_gpr' type-id='a0e54114' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='104' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='read_std' type-id='d833d349' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='113' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='read_phys' type-id='9f71e61a' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='125' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='write_std' type-id='d833d349' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='136' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='fetch' type-id='1ecd7ef8' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='146' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='read_emulated' type-id='1ecd7ef8' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='156' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='448'>
          <var-decl name='write_emulated' type-id='1ecd7ef8' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='167' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='512'>
          <var-decl name='cmpxchg_emulated' type-id='e3992e96' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='180' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='invlpg' type-id='b3dcf7c2' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='186' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='pio_in_emulated' type-id='bf0bc703' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='188' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='pio_out_emulated' type-id='bf0bc703' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='192' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='get_segment' type-id='2dc9d3a1' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='196' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='set_segment' type-id='e58da7ba' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='198' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='get_cached_segment_base' type-id='c6aea752' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='200' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='get_gdt' type-id='fb7986de' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='202' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='get_idt' type-id='fb7986de' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='203' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='set_gdt' type-id='fb7986de' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='204' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='set_idt' type-id='fb7986de' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='205' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='get_cr' type-id='c13d8d67' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='206' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='set_cr' type-id='32c5f970' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='207' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='cpl' type-id='f814b661' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='208' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='get_dr' type-id='2d2ef9ec' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='209' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='set_dr' type-id='32c5f970' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='210' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='get_smbase' type-id='8fa96f0c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='211' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='set_smbase' type-id='8b244ed6' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='212' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1664'>
          <var-decl name='set_msr' type-id='cdd3e944' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='213' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1728'>
          <var-decl name='get_msr' type-id='b6bb1d0d' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='214' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='check_pmc' type-id='abdf39c8' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='215' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1856'>
          <var-decl name='read_pmc' type-id='b6bb1d0d' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='216' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='halt' type-id='19a8b4de' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='217' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='wbinvd' type-id='19a8b4de' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='218' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2048'>
          <var-decl name='fix_hypercall' type-id='f814b661' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='219' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2112'>
          <var-decl name='intercept' type-id='29ecc68a' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='220' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2176'>
          <var-decl name='get_cpuid' type-id='674146d6' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='224' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2240'>
          <var-decl name='guest_has_long_mode' type-id='3e2412c3' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='226' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='guest_has_movbe' type-id='3e2412c3' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='227' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2368'>
          <var-decl name='guest_has_fxsr' type-id='3e2412c3' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='228' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2432'>
          <var-decl name='guest_has_rdpid' type-id='3e2412c3' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='229' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2496'>
          <var-decl name='set_nmi_mask' type-id='d34bff1f' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='231' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2560'>
          <var-decl name='get_hflags' type-id='0e69bbfa' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='233' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2624'>
          <var-decl name='exiting_smm' type-id='19a8b4de' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='234' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2688'>
          <var-decl name='leave_smm' type-id='11092180' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='235' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2752'>
          <var-decl name='triple_fault' type-id='19a8b4de' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='236' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='set_xcr' type-id='cdd3e944' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='237' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='operand' size-in-bits='512' is-struct='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='241' column='1' id='09117236'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='type' type-id='08f5ca17' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='242' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='bytes' type-id='f0981eeb' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='243' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='count' type-id='f0981eeb' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='244' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='' type-id='ac5ab599' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='245' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='addr' type-id='ac5ab59a' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='257' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='' type-id='ac5ab59b' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='258' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='__anonymous_enum__' is-anonymous='yes' filepath='arch/x86/kvm/kvm_emulate.h' line='242' column='1' id='08f5ca17'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='OP_REG' value='0'/>
        <enumerator name='OP_MEM' value='1'/>
        <enumerator name='OP_MEM_STR' value='2'/>
        <enumerator name='OP_IMM' value='3'/>
        <enumerator name='OP_XMM' value='4'/>
        <enumerator name='OP_MM' value='5'/>
        <enumerator name='OP_NONE' value='6'/>
      </enum-decl>
      <union-decl name='__anonymous_union__52' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='245' column='1' id='ac5ab599'>
        <data-member access='public'>
          <var-decl name='orig_val' type-id='3aa0f67c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='246' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='orig_val64' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='247' column='1'/>
        </data-member>
      </union-decl>
      <union-decl name='__anonymous_union__53' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='249' column='1' id='ac5ab59a'>
        <data-member access='public'>
          <var-decl name='reg' type-id='a163c962' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='250' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='mem' type-id='569dd140' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='254' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='xmm' type-id='f0981eeb' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='255' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='mm' type-id='f0981eeb' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='256' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='segmented_address' size-in-bits='128' is-struct='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='251' column='1' id='569dd140'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='ea' type-id='dbeaada5' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='252' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='seg' type-id='f0981eeb' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='253' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__54' size-in-bits='128' is-anonymous='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='258' column='1' id='ac5ab59b'>
        <data-member access='public'>
          <var-decl name='val' type-id='3aa0f67c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='259' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='val64' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='260' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='valptr' type-id='ac1fa8c0' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='261' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='vec_val' type-id='94954185' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='262' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='mm_val' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='263' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='data' type-id='eaa32e2f' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='264' column='1'/>
        </data-member>
      </union-decl>
      <class-decl name='fetch_cache' size-in-bits='256' is-struct='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='268' column='1' id='59f44836'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='data' type-id='4d823bde' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='269' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='ptr' type-id='8bff8096' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='270' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='end' type-id='8bff8096' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='271' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='read_cache' size-in-bits='8320' is-struct='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='274' column='1' id='52faefb4'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='data' type-id='07312fb9' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='275' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8192'>
          <var-decl name='pos' type-id='3aa0f67c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='276' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='8256'>
          <var-decl name='end' type-id='3aa0f67c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='277' column='1'/>
        </data-member>
      </class-decl>
      <enum-decl name='x86emul_mode' filepath='arch/x86/kvm/kvm_emulate.h' line='281' column='1' id='564e62d1'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='X86EMUL_MODE_REAL' value='0'/>
        <enumerator name='X86EMUL_MODE_VM86' value='1'/>
        <enumerator name='X86EMUL_MODE_PROT16' value='2'/>
        <enumerator name='X86EMUL_MODE_PROT32' value='3'/>
        <enumerator name='X86EMUL_MODE_PROT64' value='4'/>
      </enum-decl>
      <typedef-decl name='fastop_t' type-id='9b99f5e7' filepath='arch/x86/kvm/kvm_emulate.h' line='300' column='1' id='94084516'/>
      <class-decl name='x86_emulate_ctxt' size-in-bits='21376' is-struct='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='302' column='1' id='1b827017'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='vcpu' type-id='eaa32e2f' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='303' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='ops' type-id='e3188297' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='304' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='eflags' type-id='3aa0f67c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='307' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='192'>
          <var-decl name='eip' type-id='3aa0f67c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='308' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='256'>
          <var-decl name='mode' type-id='564e62d1' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='310' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='288'>
          <var-decl name='interruptibility' type-id='95e97e5e' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='313' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='320'>
          <var-decl name='perm_ok' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='315' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='328'>
          <var-decl name='tf' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='316' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='336'>
          <var-decl name='have_exception' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='318' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='384'>
          <var-decl name='exception' type-id='5eefb59b' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='319' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='gpa_available' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='322' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='gpa_val' type-id='f184b22d' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='323' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='opcode_len' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='330' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='712'>
          <var-decl name='b' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='331' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='720'>
          <var-decl name='intercept' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='332' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='728'>
          <var-decl name='op_bytes' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='333' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='ad_bytes' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='334' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='' type-id='ac5ab59c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='335' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='check_perm' type-id='f814b661' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='339' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='rip_relative' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='345' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='904'>
          <var-decl name='rex_prefix' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='346' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='912'>
          <var-decl name='lock_prefix' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='347' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='920'>
          <var-decl name='rep_prefix' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='348' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='928'>
          <var-decl name='regs_valid' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='350' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='regs_dirty' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='352' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='992'>
          <var-decl name='modrm' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='354' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1000'>
          <var-decl name='modrm_mod' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='355' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1008'>
          <var-decl name='modrm_reg' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='356' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1016'>
          <var-decl name='modrm_rm' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='357' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='modrm_seg' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='358' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1032'>
          <var-decl name='seg_override' type-id='f9b06939' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='359' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1088'>
          <var-decl name='d' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='360' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1152'>
          <var-decl name='_eip' type-id='3aa0f67c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='361' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='src' type-id='09117236' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='364' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1792'>
          <var-decl name='src2' type-id='09117236' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='365' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2304'>
          <var-decl name='dst' type-id='09117236' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='366' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='2816'>
          <var-decl name='memop' type-id='09117236' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='367' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='3328'>
          <var-decl name='_regs' type-id='472c2ee4' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='368' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4416'>
          <var-decl name='memopp' type-id='51b3141c' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='369' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4480'>
          <var-decl name='fetch' type-id='59f44836' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='370' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='4736'>
          <var-decl name='io_read' type-id='52faefb4' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='371' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='13056'>
          <var-decl name='mem_read' type-id='52faefb4' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='372' column='1'/>
        </data-member>
      </class-decl>
      <union-decl name='__anonymous_union__51' size-in-bits='64' is-anonymous='yes' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='335' column='1' id='ac5ab59c'>
        <data-member access='public'>
          <var-decl name='execute' type-id='f814b661' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='336' column='1'/>
        </data-member>
        <data-member access='public'>
          <var-decl name='fop' type-id='94084516' visibility='default' filepath='arch/x86/kvm/kvm_emulate.h' line='337' column='1'/>
        </data-member>
      </union-decl>
      <enum-decl name='x86_intercept_stage' filepath='arch/x86/kvm/kvm_emulate.h' line='424' column='1' id='1cfbd306'>
        <underlying-type type-id='9cac1fee'/>
        <enumerator name='X86_ICTP_NONE' value='0'/>
        <enumerator name='X86_ICPT_PRE_EXCEPT' value='1'/>
        <enumerator name='X86_ICPT_POST_EXCEPT' value='2'/>
        <enumerator name='X86_ICPT_POST_MEMACCESS' value='3'/>
      </enum-decl>
      <class-decl name='kvm_timer' size-in-bits='1088' is-struct='yes' visibility='default' filepath='arch/x86/kvm/lapic.h' line='32' column='1' id='65e859f5'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='timer' type-id='b6993efc' visibility='default' filepath='arch/x86/kvm/lapic.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='576'>
          <var-decl name='period' type-id='9b7c55ef' visibility='default' filepath='arch/x86/kvm/lapic.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='640'>
          <var-decl name='target_expiration' type-id='fbc017ef' visibility='default' filepath='arch/x86/kvm/lapic.h' line='35' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='704'>
          <var-decl name='timer_mode' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/lapic.h' line='36' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='736'>
          <var-decl name='timer_mode_mask' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/lapic.h' line='37' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='768'>
          <var-decl name='tscdeadline' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/lapic.h' line='38' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='832'>
          <var-decl name='expired_tscdeadline' type-id='91ce1af9' visibility='default' filepath='arch/x86/kvm/lapic.h' line='39' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='896'>
          <var-decl name='timer_advance_ns' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/lapic.h' line='40' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='960'>
          <var-decl name='advance_expire_delta' type-id='9b7c55ef' visibility='default' filepath='arch/x86/kvm/lapic.h' line='41' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1024'>
          <var-decl name='pending' type-id='49178f86' visibility='default' filepath='arch/x86/kvm/lapic.h' line='42' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1056'>
          <var-decl name='hv_timer_in_use' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/lapic.h' line='43' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='kvm_lapic' size-in-bits='2048' is-struct='yes' visibility='default' filepath='arch/x86/kvm/lapic.h' line='46' column='1' id='7d2319d1'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='base_address' type-id='3aa0f67c' visibility='default' filepath='arch/x86/kvm/lapic.h' line='47' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='dev' type-id='cc81b603' visibility='default' filepath='arch/x86/kvm/lapic.h' line='48' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
          <var-decl name='lapic_timer' type-id='65e859f5' visibility='default' filepath='arch/x86/kvm/lapic.h' line='49' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1216'>
          <var-decl name='divide_count' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/lapic.h' line='50' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1280'>
          <var-decl name='vcpu' type-id='9dc98dce' visibility='default' filepath='arch/x86/kvm/lapic.h' line='51' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1344'>
          <var-decl name='sw_enabled' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/lapic.h' line='52' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1352'>
          <var-decl name='irr_pending' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/lapic.h' line='53' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1360'>
          <var-decl name='lvt0_in_nmi_mode' type-id='b50a4934' visibility='default' filepath='arch/x86/kvm/lapic.h' line='54' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1376'>
          <var-decl name='isr_count' type-id='9b7e9486' visibility='default' filepath='arch/x86/kvm/lapic.h' line='56' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1408'>
          <var-decl name='highest_isr_cache' type-id='95e97e5e' visibility='default' filepath='arch/x86/kvm/lapic.h' line='58' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1472'>
          <var-decl name='regs' type-id='eaa32e2f' visibility='default' filepath='arch/x86/kvm/lapic.h' line='64' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1536'>
          <var-decl name='vapic_addr' type-id='f184b22d' visibility='default' filepath='arch/x86/kvm/lapic.h' line='65' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1600'>
          <var-decl name='vapic_cache' type-id='489b1b1d' visibility='default' filepath='arch/x86/kvm/lapic.h' line='66' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1920'>
          <var-decl name='pending_events' type-id='3aa0f67c' visibility='default' filepath='arch/x86/kvm/lapic.h' line='67' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='1984'>
          <var-decl name='sipi_vector' type-id='f0981eeb' visibility='default' filepath='arch/x86/kvm/lapic.h' line='68' column='1'/>
        </data-member>
      </class-decl>
      <class-decl name='nested_vmx_msrs' size-in-bits='896' is-struct='yes' visibility='default' filepath='arch/x86/kvm/vmx/capabilities.h' line='25' column='1' id='049e91a0'>
        <data-member access='public' layout-offset-in-bits='0'>
          <var-decl name='procbased_ctls_low' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/vmx/capabilities.h' line='31' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='32'>
          <var-decl name='procbased_ctls_high' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/vmx/capabilities.h' line='32' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='64'>
          <var-decl name='secondary_ctls_low' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/vmx/capabilities.h' line='33' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='96'>
          <var-decl name='secondary_ctls_high' type-id='19c2251e' visibility='default' filepath='arch/x86/kvm/vmx/capabilities.h' line='34' column='1'/>
        </data-member>
        <data-member access='public' layout-offset-in-bits='128'>
